{
	//Config
	
	"config.Nickname.name": "Nickname",
	"config.Nickname.description": "The affectionate nickname Harvey will use for you in most cases when dating/married.",
	"config.Gift Tastes.name": "Gift Tates",
	"config.Gift Tastes.values.Fully Modded": "Fully Modded",
	"config.Gift Tastes.values.Modded Reactions Only": "Modded Reactions Only",
	"config.Gift Tastes.values.Vanilla": "Vanilla",
	"config.Gift Tastes.description": "Fully Modded makes him allergic to shellfish based on his hated dialogue. Crustaceans, molluscs and shellfish dishes will be hated gifts. Modded Reactions Only includes expanded gift dialogue but no changes to tastes. Vanilla will retain normal gift tastes and reactions for compatability with other mods.",
	"config.Marriage Schedule.name": "Marriage Schedule",
	"config.Marriage Schedule.values.Modded": "Modded",
	"config.Marriage Schedule.values.Vanilla": "Vanilla",
	"config.Marriage Schedule.description": "Modded has alternating seasonal outings on Mondays: Spring/Fall is shop and then mountains nature walk, Summer/Winter is shop and then library. Vanilla is pure vanilla for compatability with other mods.",
	"config.Death Type.name": "Death Type",
	"config.Death Type.values.No Penalty": "No Penalty",
	"config.Death Type.values.Mines Penalty": "Mines Penalty",
	"config.Death Type.values.Hospital Penalty": "Hospital Penalty",
	"config.Death Type.values.Vanilla": "Vanilla",
	"config.Death Type.description": "What will happen upon PlayerKilled when married to Harvey. All feature modded married dialogue except for vanilla.",
	"config.Maru Edits.name": "Maru Edits",
	"config.Maru Edits.description": "Enables some extra edits to Maru's events and dialog to better establish her friendship with Harvey. Completely optional, I just also like Maru and am invested in them being buds :)",
	
	//General
	
	"HarveyPlus.intro": "It's a pleasure to meet you. I'm Harvey, the local doctor.#$e#I attend to the medical needs of all the residents of Pelican Town. It's rewarding work.#$e#I hope you'll find your own work equally rewarding, in time.$h",
	"HarveyPlus.GreenRain2.1": "The first time this happened, we were all worried that the rain might be dangerous.#$b#But what if it's actually healthy for the body? Who knows... The plants seem to respond well to it, at least.",
	"HarveyPlus.GreenRain2.2": "Have you noticed whether the rain has any effect on your crops?#$e#Imagine a melon the size of a car...!$8",
	"HarveyPlus.GreenRain2.3": "I'm glad that the rain seems to be harmless, at least.#$e#We definitely didn't cover anything like it in medical school.",	
	"HarveyPlus.AcceptBirthdayGift.Pos": "$query PLAYER_NPC_RELATIONSHIP current Harvey dating married#Thank you so much, {{Nickname}}. I love it!|Oh! Thank you very much! I didn't expect anyone to know it was my birthday today.$h",
	"HarveyPlus.AcceptBirthdayGift.Neg": "$query PLAYER_NPC_RELATIONSHIP current Harvey dating married#Oh... it... well I suppose it's the thought that counts.|Oh! It's a... well, it's something. I didn't expect anyone to know it was my birthday today.",
	"HarveyPlus.GiftLove.1": "$query PLAYER_NPC_RELATIONSHIP current Harvey dating married#Oh, for me? Thank you! You know me so well.|It's for me? This is my favorite stuff! It's like you read my mind.",
	"HarveyPlus.GiftLove.2": "$query PLAYER_NPC_RELATIONSHIP current Harvey dating married#Are you sure you aren't a mind-reader? I was just thinking about this stuff.|Really? Thank you! How did you know this was my favorite?",
	"HarveyPlus.GiftLike.1": "$query PLAYER_NPC_RELATIONSHIP current Harvey dating married#Thank you, {{Nickname}}. That means a lot.|That's such a nice gift. Thank you!",
	"HarveyPlus.GiftLike.2": "$query PLAYER_NPC_RELATIONSHIP current Harvey dating married#What a sweet gift! I'm flattered.|I like this a lot. It was nice of you to think of me.",
	"HarveyPlus.GiftNeutral": "Thanks. That's very kind of you.", //I think it's funniest if the neutral dialogue is completely the same no matter what
	"HarveyPlus.GiftDislike.1": "$query PLAYER_NPC_RELATIONSHIP current Harvey dating married#Mmm... good effort, @.|Hmm... Are you sure this is healthy?",
	"HarveyPlus.GiftDislike.2": "$query PLAYER_NPC_RELATIONSHIP current Harvey dating married#Oh, this is... I'll figure out something to do with this.|Thank you? I'm not sure what you expect me to do with this.",
	"HarveyPlus.GiftHate.1": "$query PLAYER_NPC_RELATIONSHIP current Harvey dating married#I'm pretty sure I told you I was allergic to this.$a|...I think I'm allergic to this.",
	"HarveyPlus.GiftHate.2": "$query PLAYER_NPC_RELATIONSHIP current Harvey dating married#Yikes. Are you trying to tell me something?|That's not very kind of you, @.",
	"HarveyPlus.Resort": "I'll let you in on a little secret... I never really learned how to swim.$s#$e#Deep water is terrifying.#$b#At least when you're up high you can see what's below you.$s",
	//you'll notice some of the negative reactions here are a little sharp and that's because uwu wibbly baby softboi harvey is boring he is a full ass adult man let the guy have layers and be angry sometimes
	//the kind guys are the ones who are most capable of being venemous little shits when they're upset
	//also if you spend a lot of your life very lonely and then think you finally found someone to be close to and then they ditch you that is going to make you a lil bitter maybe
	"HarveyPlus.divorced.1": "I... I can't look at you. Please spare me any more pain.$s",
	"HarveyPlus.divorced.2": "Just leave me alone. Please.$s",
	"HarveyPlus.divorced.3": "I don't have anything to say to you, @.$a",
	"HarveyPlus.divorced.4": "%Harvey is pointedly ignoring you.",
	"HarveyPlus.divorced.5": "I think it would be healthier for the both of us if you and I avoided each other.$a",
	"HarveyPlus.divorced.6": "...$a",
	"HarveyPlus.DumpsterDiveComment": "Oh, that's... you have to know that's not sanitary.$s",
	"HarveyPlus.AcceptBouquet": "... what?#$b#I mean, yes! Of course!$8#$b#Sorry, I just wasn't expecting... I've wanted to ask you for weeks but could never find the courage.$1",
	"HarveyPlus.Engaged1": "There's so much to set up before the wedding! I have to admit I'm nervous.$1#$e#I'll be relieved after we're all settled in on your farm.$h",
	"HarveyPlus.Engaged2": "I'm so happy.$h#$e#This is something I always wanted, deep down.$l",
	"HarveyPlus.RejectBouquet_Divorced": "That's not funny, @.$a",
	"HarveyPlus.RejectBouquet_NpcAlreadyMarried": "Oh! Uh, that's flattering, but I'm already happily married to {0}... you didn't know?",
	"HarveyPlus.RejectBouquet": "Um. Maybe take me out for coffee first, alright?",
	"HarveyPlus.RejectGift_Divorced": "I don't want anything from you.$a",
	"HarveyPlus.RejectMermaidPendant_Divorced": "... No. Are you kidding?$a",
	"HarveyPlus.RejectMermaidPendant_NeedHouseUpgrade": "Oh... it's not that I don't want to, but I'm not sure there's room for the both of us in your cabin.$s",
	"HarveyPlus.RejectMermaidPendant_NpcWithSomeoneElse": "Um... I'm not sure what {0} would think about that.",
	"HarveyPlus.RejectMermaidPendant_Under10Hearts": "Can I have some time to think about this first?",
	"HarveyPlus.RejectMermaidPendant_Under10Hearts_AskedAgain": "... I meant more time than that, @.",
	"HarveyPlus.RejectMermaidPendant": "Oh. Uh. I'm flattered, but that's not the kind of thing I'd want to rush into.$s",
	"HarveyPlus.RejectMovieTicket_Divorced": "No.$a#$b#Thank you.$a",
	"HarveyPlus.RejectMovieTicket_DontWantToSeeThatMovie": "That's a nice offer, but that's not really my kind of film. I probably wouldn't be very good company.",
	"HarveyPlus.RejectMovieTicket": "Thank you for the offer, but I'm incredibly busy today. Maybe some other time?",
	
	//Events
	
	//Intro event
	
	"HarveyPlus.Intro.1": "Hello, @! You have great timing.#$b#We were just about to send you a letter asking you to come in.",
	"HarveyPlus.Intro.2": "It's nothing serious, don't worry.#$b#We just wanted to get your patient intake forms filled out sooner rather than later.#$b#This is a small operation but it does help to be organized.",
	"HarveyPlus.Intro.3": "What he means is it helps me have to file less paperwork.$h",
	"HarveyPlus.Intro.4": "Do you have time to fill out the forms?#Actually, I already have a doctor in Zuzu City.#No thanks. I like to live dangerously.",
	"HarveyPlus.ZuzuAnswer": "Oh, I see. You should stick with them, then: continuity of care is important to maintain whenever possible.",
	"HarveyPlus.DangerAnswer": "Hm. I wouldn't exactly say that's advisable, but it's ultimately up to you.$s",
	"HarveyPlus.Intro.6": "He looks kind of... relieved?",
	"HarveyPlus.Intro.7": "If you have any prescriptions you can still have them sent here so you don't have to bus into Zuzu City quite as often.",
	"HarveyPlus.Intro.5": "Just remember, we're here if you ever have an emergency.#$b#Have a good day, @.",
	"HarveyPlus.Intro.8": "See you later!$h",
	
	//Two Heart Event
	
	"HarveyPlus.2Hearts.1": "Okay, George. I want you take a deep breath for me.",
	"HarveyPlus.2Hearts.2": "Mmhmm... and hold it... now breathe out.",
	"HarveyPlus.2Hearts.3": "Great. Now turn around, please.",
	"HarveyPlus.2Hearts.4": "How has your breathing been? Any increase in coughing or shortness of breath?",
	"HarveyPlus.2Hearts.5": "Hmmph... I can breathe just fine. Just because I'm in this chair doesn't mean the rest of me doesn't work!",
	"HarveyPlus.2Hearts.6": "That's good. My goal is to keep it that way.#$b#I think it would be good for you to try to get out of the house more. Fresh air and exercise can only help you stay healthy.",
	"HarveyPlus.2Hearts.7": "I don't see why I should bother. Fresh air isn't going to make me any less old.",
	"HarveyPlus.2Hearts.8": "George...$s#$b#Obviously I can't make you do anything, but I do strongly recommend—",
	"HarveyPlus.2Hearts.9": "Oh!#$b#I'm sorry, but you shouldn't be here... these check-ups are supposed to be private.",
	"HarveyPlus.2Hearts.10": "Not so fast! I'd like to get a second opinion from this ${young man^young lady^youngster}$.",
	"HarveyPlus.2Hearts.11": "Alright...",
	"HarveyPlus.2Hearts.12": "$q HarveyPlus.George1/HarveyPlus.George2 null#What do you think George should do?#$r HarveyPlus.George1 40 event_george1 friend_George_0#He could keep Evelyn company sometimes while she gardens.#$r HarveyPlus.George2 -40 event_george2 friend_George_40#He's right. It won't make a difference.",
	"HarveyPlus.George1": "That's an excellent suggestion, @.$h#$b# What do you think, George? Worth a try?",
	"HarveyPlus.George2": "*sigh* Poor health isn't an intrinsic part of being old.$s#$b# It just takes more effort to maintain good health the older you get.",
	"HarveyPlus.2Hearts.13": "Fine. I guess I could try it.",
	"HarveyPlus.2Hearts.14": "$p HarveyPlus.George2 #Thank you for your input, @. Now, I really do insist that you leave.|#Thanks for your help, @. I appreciate it.$h#$b#Even if you still really shouldn't be here.",
	"HarveyPlus.2Hearts.After": "George said he's going to try going out at least once a week when the weather's nice.#$b#It's a great start!$h",
	
	//Maru Four Heart Event
	
	"HarveyPlus.Maru4Hearts.1": "*sigh*... I'm so sick of preparing samples...$s#$b#It's just like being at home but with a different coat of paint.$s",
	"HarveyPlus.Maru4Hearts.2": "Agh! Oh no!... $4",
	"HarveyPlus.Maru4Hearts.3": "The whole sample is ruined... Harvey's going to kill me...$s",
	"HarveyPlus.Maru4Hearts.4": "$q 38 null#@, what should I do?#$r 38 -50 Event_Hospital_1#Just scoop it off the floor. He won't know the difference.#$r 39 -20 Event_Hospital_2#Tell Harvey it was my fault.#$r 38 50 Event_Hospital_3#Tell Harvey it was an accident.",
	"HarveyPlus.Event_Hospital_1": "Of course he'll know the difference! There's broken glass all over the floor!%fork$s",
	"HarveyPlus.Event_Hospital_2": "You think he'll buy that? I guess...$u",
	"HarveyPlus.Event_Hospital_3": "You're right. I should just tell him the truth.%fork",
	"HarveyPlus.Maru4Hearts.5": "Maru, are you alright? I heard something break.",
	"HarveyPlus.Maru4Hearts.6": "$p 38#I accidentally dropped one of the samples... I'm so sorry.$s|@ came in and slammed the door so loud I dropped the sample.$u",
	"HarveyPlus.Maru4Hearts.7": "It doesn't really matter whose fault it was. Either way, we can't use it.",
	"HarveyPlus.Maru4Hearts.8": "*sigh*... I'll call the patient back in so we can re-collect the sample.$s",
	"HarveyPlus.Maru4Hearts.9": "Mistakes happen, but please try and be more focused on your work next time.",
	"HarveyPlus.Maru4Hearts.10": "It's alright. We can get another one.#$b#It's not as though it's a big imposition when most of our patients are a five minute walk away.$h", 
	"HarveyPlus.Maru4Hearts.11": "Yeah... you're right. It's not such a big deal.#$b#Thanks for being patient with me, Dr. Harvey.",
	"HarveyPlus.Maru4Hearts.12": "Of course. Do you know how many things I dropped during my residency? It happens.#$b#You've really been a huge help around here, Maru.",
	"HarveyPlus.Maru4Hearts.13": "Alright. I have paperwork to get back to.#$b#Just make sure you get this cleaned up. We don't want anyone stepping on broken glass.",
	"HarveyPlus.Maru4Hearts.14": "Huh. That wasn't so bad.#$b#My dad still treats me like a little kid whenever I mess something up in the lab at home.$u",
	"HarveyPlus.Maru4Hearts.15": "It's nice to be treated like a colleague instead.",
	
	//6 Heart Event
	
	"HarveyPlus.6Hearts.After1": "I've never told anyone about my interest in aviation or my model planes before...#$b#You're just easy to talk to, I guess.",
	"HarveyPlus.6Hearts.After2": "pb wants to put something here but isn't sure what yet so this is placeholder text lol lmao",
	
	//Weekly Dialogue
	
	"HarveyPlus.Mon.1": "We sell a few over-the-counter medications at the clinic... feel free to stop by if you're feeling exhausted.",
	"HarveyPlus.Mon.2": "I know that being a farmer is pretty tiring work... don't overdo it!",
	"HarveyPlus.Mon.3": "What are your plans for this coming week, @?#$e#Nothing too dangerous, I hope.",
	"HarveyPlus.Mon.4": "I feel responsible for the health of this whole community... it's kind of stressful.#$e#It's a small town, and I'm fortunate to be able to build a good relationship with my patients.#$e#But that comes with its own problems...$s",
	"HarveyPlus.Mon.5": "There's only so much we can realistically handle at the clinic.#$b#Part of being a good doctor is knowing when to refer your patient to someone else.",
	"HarveyPlus.Mon.6": "Sometimes I feel as though I wake up tired. Do you ever have days like that?",
	"HarveyPlus.Mon.7": "I have an entire drawer in my kitchen full of recipes I've clipped out of magazines.#$e#In theory it's a great idea but in practice I don't think I open the drawer unless I'm putting another one in.$h",
	"HarveyPlus.Mon.8": "I think I'd like to stay in Stardew Valley permanently. I'm finally starting to feel involved in the community.#$e#It feels good to know that you're liked as well as useful.",
	"HarveyPlus.Mon.9": "I've started really making an effort to cook more regularly.#$b#You're welcome to come over for dinner sometime, {{Nickname}}. Having someone else to cook for would be nice.$1",
	"HarveyPlus.Mon.10": "Lately I've been feeling like a weight's been lifted off my shoulders.#$b#It's funny; I got so used to it that I almost didn't notice it was there until it was gone.",
	
	"HarveyPlus.Tue.1": "It's a beautiful day, isn't it?#$e#I wish I had less work to do.$s",
	"HarveyPlus.Tue.2": "If you ever have questions and I'm not available, ask Maru.#$e#She's very knowledgeable.",
	"HarveyPlus.Tue.3": "There's a documentary about the medical practices of ancient civilizations on TV later tonight.#$b#Hopefully I'll finish my reports in time!",
	"HarveyPlus.Tue.4": "I have to do a lot of reading to keep up with the best practices for patient care.#$e#At least I like reading!$h",
	"HarveyPlus.Tue.5": "I want to form a good rapport with my patients, but getting too close presents a conflict of interest.$s#$b#It's a difficult balance to maintain.#$e#We can be friendly, but we can't entirely be friends.",
	"HarveyPlus.Tue.6": "Did you know you can develop allergies later in life?#$b#I only recently became allergic to shellfish.#$e#I'm going to miss pasta with clam sauce...$s",
	"HarveyPlus.Tue.7": "It's difficult knowing that no matter how much advice I give, it's up to my patients whether or not they take it.#$e#I worry about George and Pam a lot.$s",
	"HarveyPlus.Tue.8": "$query PLAYER_NPC_RELATIONSHIP current Harvey dating married#Don't overwork yourself, @.#$e#Your health is important to me.|Don't overwork yourself, @. #$e#If our farmers get sick, where will we get our food? We need you!$h",
	"HarveyPlus.Tue.9": "It's good to see you, @.#$e#I admit it's nice to have something to get out of bed for besides work.$1",
	"HarveyPlus.Tue.10": "They say that just smiling more can improve your health.#$e#I was always a little dubious about that.#$b#Being with you is starting to convince me, though.$h",
	
	"HarveyPlus.Wed.1": "Remember to cover your mouth when you sneeze.#$e#Then make sure to wash your hands.",
	"HarveyPlus.Wed.2": "It's a great help having Maru working at the clinic.#$e#She invented an entirely new way of organizing our records. It's much more intuitive!$h",
	"HarveyPlus.Wed.3": "I moved here right after graduating my residency.#$e#That would have been... wow. Longer ago than I thought.$s",
	"HarveyPlus.Wed.4": "$query PLAYER_HAS_SEEN_EVENT current HarveyPlus.4Hearts#I'd like to get to know you better, @.#$b# We should get coffee again sometime.$h|I'd like to get to know you better, @.#$b# We should get coffee at the Stardrop Saloon sometime.$h",
	"HarveyPlus.Wed.5": "I've found that it's good for my health to try and stay positive.#$e#It's not always easy, but I do think you can find a silver lining on any cloud if you look hard enough.",
	"HarveyPlus.Wed.6": "It's nice to have another friend in town.$h#$b# I always worried that I was boring Maru when it was just the two of us.",
	"HarveyPlus.Wed.7": "You know, I had a lot of acquaintances during my time in medical school...#$b#I don't know if I ever had any actual friends.$s",
	"HarveyPlus.Wed.8": "It's funny. In an emergency situation I almost forget to be afraid: all that matters is taking care of the patient.#$e$It usually only catches up to me afterwards.$s#$b#That's probably better than the alternative.",
	"HarveyPlus.Wed.9": "You have a really healthy glow. That's good.$h",
	"HarveyPlus.Wed.10": "Usually by the middle of the week I'd be starting to hit a slump.#$b#I think your energy is infectious!$h",
	
	"HarveyPlus.Thu.1": "I live above the clinic. I admit it's convenient, not having a commute.",
	"HarveyPlus.Thu.2": "Nutrition is important, so make sure and eat well. Try to increase your vegetable intake.#$e##$q HarveyPlus.41/HarveyPlus.42 Thu_2_None#Home-cooked meals are best. Do you cook?#$r HarveyPlus.41 25 Thu_2_Yes#I love to cook!#$r HarveyPlus.41 0 Thu_2_Busy#I'm usually too busy...#$r HarveyPlus.42 -5 Thu_2_No#I have more important things to spend time on.",
	"HarveyPlus.Thu.2.Yes": "That's good! You'll have no trouble staying healthy, then.$h",
	"HarveyPlus.Thu.2.Busy": "Ah, yes. I know how that is.$s#$b#Still, even the occasional healthy meal is better than none.",
	"HarveyPlus.Thu.2.No":  "Ah... right. I'm sure you're very busy with the farm.$s",
	"HarveyPlus.Thu.2.None": "$p HarveyPlus.42#You really should try to make the time.|It definitely makes my job easier.",
	"HarveyPlus.Thu.3": "I'm what you'd call a family practice physician.#$b#Taking care of someone from birth til death... that's a lot of responsibility. I take it very seriously.",
	"HarveyPlus.Thu.4": "I probably drink more coffee than is strictly healthy.$s#$b#But all that paperwork wouldn't get done otherwise!",
	"HarveyPlus.Thu.5": "I try and attend every town festival, even if I find crowds overwhelming.#$e#It's good for me to get out of the clinic sometimes.",
	"HarveyPlus.Thu.6": "%revealtaste:Maru:432 I tried making my own pickles once.#$b#I think I'm the reason Maru won't eat them now.$s",
	"HarveyPlus.Thu.7": "Do you ever listen to music while you're working?#$b#I find it helps the time go by much faster.$h",
	"HarveyPlus.Thu.8": "I always wanted to work in a smaller, underserved community.#$b#It can vastly improve quality of life to have easier access to medical care.#$e#Imagine how much crankier George would be if he had to go all the way to Zuzu City for his checkups!$h",
	"HarveyPlus.Thu.9": "I wrote the wrong date on a report the other day.#$b#I was thinking about you and got distracted.$1",
	"HarveyPlus.Thu.10": "Maintaining work-life balance has always been something I struggle with.$s#$e#If I didn't live alone I think it would be easier.$l",
	
	"HarveyPlus.Fri.1": "Feel free to stop by my office if you're ever feeling ill.#$e#Though the farming lifestyle is very active. You'll probably stay healthy without trying.$h",
	"HarveyPlus.Fri.2": "Remember to stay hydrated. You'd be surprised at how many people don't drink enough water.",
	"HarveyPlus.Fri.3": "Any exciting plans for the weekend, @?#$e#Remember, everything in moderation!",
	"HarveyPlus.Fri.4": "You're welcome to visit me at my apartment any time you like.#$e#I don't often have company. It would be a nice change of pace.",
	"HarveyPlus.Fri.5": "I've found that being a doctor is very fulfilling work.#$b#I've always felt happiest when I'm helping other people.",
	"HarveyPlus.Fri.6": "It's kind of you to make time to talk with me, @.#$e#It always brightens my day.$h",
	"HarveyPlus.Fri.7": "Living where I work makes some things easier... on the other hand, it makes it difficult to ever stop working.",
	"HarveyPlus.Fri.8": "I had a phase as a child where I was convinced I wanted to be a jazz pianist.$#b#At my first recital I threw up before I even got on stage. I never played the piano again.#$e#It was mortifying then but it's kind of funny now.$h",
	"HarveyPlus.Fri.9": "I've been thinking about setting up a little herb garden in my window, {{Nickname}}.#$e#If you have any tips for keeping plants alive, I'd love to hear them.$h",
	"HarveyPlus.Fri.10": "{{Nickname}}, I know I'm not technically your doctor...#$b#But if you ever need a 'confidential checkup' you know where to find me.$1",
	
	"HarveyPlus.Sat.1": "I never really relax, even on weekends.#$e#It's not as though I can say 'sorry, it's my day off' if there's a medical emergency.",
	"HarveyPlus.Sat.2": "Did you know the museum library has an extensive microfiche collection?#$e# It's fascinating to read news articles from decades ago. Things were very different then.",
	"HarveyPlus.Sat.3": "I imagine even on weekends the farm requires a lot of attention.#$e#Ha... you and I both have jobs that it's hard to ever really put down.",
	"HarveyPlus.Sat.4": "Are you sleeping enough,@?#$b#At the very least you should be going to bed before midnight.",
	"HarveyPlus.Sat.5": "I like that Pelican town is small enough that you can walk everywhere.#$e#Driving always made me a little nervous.",
	"HarveyPlus.Sat.6": "Another week is almost over... it feels like the older I get, the faster they fly by.$s",
	"HarveyPlus.Sat.7": "I came here because I liked the small-town atmosphere and the potential for a truly holistic approach to patient care.#$e#I've grown to really love it.$h",
	"HarveyPlus.Sat.8": "Maybe I'll actually take it easy this weekend.#$e#I could finally open that bottle of wine I've been saving.",
	"HarveyPlus.Sat.9": "%Harvey is humming an upbeat jazz tune and seems completely distracted.",
	"HarveyPlus.Sat.10": "*Sigh*... I'm starting to feel kind of old...#$e#The older you get the more memories you're burdened with. It can be overwhelming.$s#$e#I think I'll stay younger with you around.$l",
	
	"HarveyPlus.Sun.1": "It's always difficult to fully enjoy Sundays, knowing that Monday is just around the corner.",
	"HarveyPlus.Sun.2": "Hmm... I'm struggling to make ends meet. I don't have enough patients.#$e#I suppose that's the trade-off for working in a rural community.",
	"HarveyPlus.Sun.3": "Be careful if you're going to go down into the mines.#$e#Remember to wear closed-toed shoes.",
	"HarveyPlus.Sun.4": "As a doctor, I'm well aware of the benefits of home-cooked food. But I'm so busy, I have a hard time bringing myself to cook.",
	"HarveyPlus.Sun.5": "I'd strongly recommend against drinking Joja Cola.#$b#I've read the ingredient list and it's... concerning.$s",
	"HarveyPlus.Sun.6": "My colleagues in Zuzu City keep telling me I should move there if money's so tight out here.#$b#I tried city life during medical school and I can say with confidence that it's not for me. Far too fast-paced.",
	"HarveyPlus.Sun.7": "Medical school was difficult, but I've never regretted the decision to pursue it.#$e#It's more than a career for me; it's a vocation. It gives me purpose.",
	"HarveyPlus.Sun.8": "Imagine having a patient's life completely in your hands, and failing to keep them alive... that's something that will haunt you forever.$s#$e#Hypothetically.",
	"HarveyPlus.Sun.9": "Some people know what they want to do with their lives from a very young age. I envy that.#$e#It took me a lot of false starts to get to where I am and I've always felt a little behind because of it.",
	"HarveyPlus.Sun.10": "Do you ever get lonely living by yourself on the farm, {{Nickname}}?#$e#Just wondering.$1",
	
	//Date and/or Season-Specific Dialogue
	
	"HarveyPlus.Spring.FlowerDance": "The Flower Dance is tomorrow. I'm not really much of a dancer, but Maru always insists I go.",
	"HarveyPlus.Fall.Mushrooms": "Did you know many of the mushrooms that grow locally are edible?$#b#Be careful of the red ones, though.",
	"HarveyPlus.Fall.Chilly": "The weather has started to turn.#$b#Add more layers if you start feeling chilly.",
	"HarveyPlus.Winter.AlmostBirthday.": "%Harvey appears to be quieter than usual. You should probably leave him be.",
	"HarveyPlus.Winter.FluShots": "Don't forget to get your flu shot this year.#$e#An ounce of prevention is worth a pound of cure, as they say.",
	
	//Festival Dialogue
	//I'm not changing all of it but there are some lines that need editing either for platonic Maru reasons or I don't like it reasons
	
	"HarveyPlus.fall16.1": "It's easy to forget how large pigs are until you're looking at them in person...",
	"HarveyPlus.fall16.1.spouse": "Let me know when you're ready to go home, {{Nickname}}. I'll just be over here.",
	"HarveyPlus.fall16.2.spouse": "Hi, {{Nickname}}. Good luck today in the competition. I just know you're going to shine!$0",
	"HarveyPlus.spring24.1": "$query PLAYER_NPC_RELATIONSHIP current Harvey dating married#Oh, @... you look ${great^lovely^wonderful}$.#1|Maru and I usually come to this event as friends.#$b#It's like highschool prom all over again.$s",
	"HarveyPlus.summer11.1": "Good thing I came with sunscreen.#$e#I feel as though I'm the only one who ever remembers to bring it.",
	"HarveyPlus.summer11.1.spouse": "Here, {{Nickname}}. Let me put some more sunscreen on your shoulders.",
	"HarveyPlus.summer11.2": "I hope you added something of high quality to the soup.#$e#We all want to leave a good impression on the Governor.",
	"HarveyPlus.summer11.2.spouse": "Hot soup has never made sense to me as the centerpiece for a Summer festival.#$e#One of these years we should try a gazpacho.",
	
	"HarveyPlus.FlowerDanceSpouse.1": "I've been looking forward to it all afternoon! You look radiant in the fresh spring air.$1",
	"HarveyPlus.FlowerDanceSpouse.2": "Of course! I was hoping you would ask.$l#$b#Not that I was ever really worried you wouldn't.$h",
	"HarveyPlus.FlowerDanceSpouse.3": "I would love to. I don't even find it all that embarassing anymore!$h",
	"HarveyPlus.FlowerDanceDecline": "Oh! Ah, no thank you.#$b#It's embarrassing enough without making a fool of myself in front of someone I barely know.$s",
	
	"HarveyPlus.WinterStar_GiveGift_Before_Spouse": "Surprise!$h#$b#You have no idea how hard it's been keeping this a secret.",
	"HarveyPlus.WinterStar_GiveGift_Before": "Hi, @. I'm your gift giver this year.",
	"HarveyPlus.WinterStar_GiveGift_After": "I hope you like it. I tried to think of something you'd find useful.$h",
	"HarveyPlus.WinterStar_ReceiveGift": "$query PLAYER_NPC_RELATIONSHIP current Harvey dating married#Oh! Thank you, {{Nickname}}.#$b#You have a great poker face. I had no idea it was you!$h|#Oh! Thank you, @.#$b#You have a great poker face. I had no idea it was you!$h",
	
	//Marriage Dialogue
	//Static Marriage Dialogue
	
	"HarveyPlus.Marriage.spring_1": "The explosion of life at the start of a new year is invigorating, don't you think?#$e#Maybe I'll get my paperwork out of the way early today.",
	"HarveyPlus.Marriage.spring_8": "The birds that left for the Winter have started coming back.#$e#I'm sure there's a science behind how they navigate. I should look it up.",
	"HarveyPlus.Marriage.spring_12": "Good luck in the egg hunt tomorrow!$h#$e#Of course I'll be there to watch, even if I'm not a big fan of the crowd...",
	"HarveyPlus.Marriage.spring_23": "Will you... will you dance with me at the festival tomorrow, {{Nickname}}?$7#$e#It's one of my favorite parts of the year.$1",
	"HarveyPlus.Marriage.summer_1": "Make sure you don't get sunburnt, {{Nickname}}!$8#$b#I've stocked up on sunscreen, so be sure to put some on before you go out.",
	"HarveyPlus.Marriage.summer_8": "I didn't sleep so well last night... it's difficult to get comfortable in this heat.$s",
	"HarveyPlus.Marriage.summer_10": "I'm always a little leery of the Luau soup.#$b#It can't be healthy to just toss a bunch of random ingredients into a pot, right?",
	"HarveyPlus.Marriage.summer_15": "I sprinkled a little diatomaceous earth around to keep the ants out.#$e#I'm not going to share the kitchen with them!$a",
	"HarveyPlus.Marriage.summer_27": "The days are going to start getting shorter soon.#$b#Sorry in advance if I seem a little withdrawn... lack of sunlight can have a negative impact on mood.",
	"HarveyPlus.Marriage.fall_1": "Make sure and diversify your harvests this fall, {{Nickname}}.#$e#Or you could just fill every plot with pumpkins.$#b#I'll figure out what to cook with them!$h",
	"HarveyPlus.Marriage.fall_8": "We have a lot to do to prepare for winter.#$b#You make sure we're stocked up on firewood and I'll get the extra blankets and winter coats out of storage.",
	"HarveyPlus.Marriage.fall_15": "Tomorrow's the Fair. I'm interested to see what you've been saving for your grange display!$h",
	"HarveyPlus.Marriage.fall_26": "Out of all the festivals, Spirit's Eve is easily my least favorite.#$b#I know it's all props and makeup, but I just don't find being scared any fun.",
	"HarveyPlus.Marriage.winter_1": "Be sure to dress warmly in the coming weeks, {{Nickname}}.#$b#I know you and I know you'll be out of the house most days even if there's no farming to do!$h",
	"HarveyPlus.Marriage.winter_7": "It might be nice to attend the festival tomorrow.#$b#Or we could stay in and drink cocoa. I'd be happy with either.#h",
	"HarveyPlus.Marriage.winter_13": "Well... I'll be another year older tomorrow. Before I met you that would have bothered me.#$b#Now it almost feels like an accomplishment!#h",
	"HarveyPlus.Marriage.winter_28": "I can't believe how quickly this year went by.#$b#Well! Here's to many more, huh?$h",
	
	"HarveyPlus.jobLeave_Harvey.1": "I have to go into the clinic today. Have a nice day, okay?",
	"HarveyPlus.jobLeave_Harvey.2": "I'm going in to work today. Let me know if you need anything from town while I'm there.",
	"HarveyPlus.jobLeave_Harvey.3": "Almost time for my morning walk to work! It's such a nice way to get regular exercise.$h",
	"HarveyPlus.jobLeave_Harvey.4": "Ah, I won't be able to finish my coffee before I leave for work...$s#$e#I guess I'll just take it with me.",
	"HarveyPlus.jobLeave_Harvey.5": "Good morning, {{Nickname}}. I'll be at the clinic today if you need me for anything.",
	"HarveyPlus.jobLeave_Harvey.6": "I have work to do at the clinic today. I'll see you tonight, {{Nickname}}.",
	"HarveyPlus.jobReturn_Harvey.1": "Hi, {{Nickname}}. Did you have a good day?#$e#My patients are still healthy, so I can't complain.$h",
	"HarveyPlus.jobReturn_Harvey.2": "I have to admit, I like going to work a lot more now that I have you to come home to.$h",
	"HarveyPlus.jobReturn_Harvey.3": "Oof... I'm exhausted. Being a doctor isn't a physically difficult job, but it's very emotionally demanding.",
	"HarveyPlus.jobReturn_Harvey.4": "Good evening, {{Nickname}}. I just got home a little bit ago. What have you been up to?",
	"HarveyPlus.jobReturn_Harvey.5": "The clinic was quiet today. In my line of work I suppose that's a good thing.",
	"HarveyPlus.jobReturn_Harvey.6": "What a long day... I think I'm going to relax for the rest of the night.",
	
	"HarveyPlus.jobVisit.1": "Hi {{Nickname}}. What are you doing at the clinic?#$e#Ah, you just came to see me. That's nice.$h",
	"HarveyPlus.jobVisit.2": "Oh, hello! Sorry, I'm a little busy right now.#$b#Not that it's not always good to see you.$1",
	"HarveyPlus.jobVisit.3": "%Harvey is counting something under his breath and looks deep in thought. Maybe it's better to leave him be while he's working.",
	"HarveyPlus.Marriage.Mon.0.1": "Hi! Did you forget something we needed to put on the grocery list?",
	"HarveyPlus.Marriage.Mon.0.2": "Hello, {{Nickname}}. I'm just picking up some essentials.#$e#And maybe a few fancy spices.#$b#I don't know what I'll do with them yet, but that's part of the fun of it.$h",
	"HarveyPlus.Marriage.Mon.0.3": "It's nice to come into town and see everyone from time to time.#$e#Somewhere other than the clinic, I mean.",
	"HarveyPlus.Marriage.Mon.0.4": "Oh, good to see you. Did you come in to drop off some produce for Pierre?",
	"HarveyPlus.Marriage.Mon.0.5": "Oh, you're here. Good timing; I wanted to ask you your thoughts on fettuccine versus pappardelle.",
	"HarveyPlus.Marriage.Mon.0.6": "Hm... Pierre's out of the medium roast I like... I guess I could try a light roast?",
	"HarveyPlus.Marriage.Mon.2.1": "%Harvey is completely absorbed in his book. The title reads: \"Radio Ettiquette: Don't Be a Knob\".",
	"HarveyPlus.Marriage.Mon.2.2": "%Harvey is reading a book called \"Birds of Ferngill\". There's a very colorful parrot on the cover.",
	"HarveyPlus.Marriage.Mon.2.3": "%\"Sustainable Farming Under Modern Capitalism\". Huh! Looks like Harvey's taking an interest in your business.",
	"HarveyPlus.Marriage.Mon.2.4": "$query PLAYER_HAS_CHILDREN current#%The book's title reads \"101 Easy Experiments to Introduce Your Child to Science\".#%b#%Looks like someone's doing research.|%The book's title reads \"Historic Wineries of Ferngill\". Looks like someone's doing research.",
	"HarveyPlus.Marriage.Mon.2.5": "%It looks like Harvey is reading a book called \"A Hip Pocket Guide to Ferngill Mushrooms\".#$b#%On the cover is a man holding a trumpet in one hand and a very large mushroom in the other.",
	"HarveyPlus.Marriage.Mon.2.6.": "%Harvey's book is titled \"Oh! The Humanity! A History of Aircraft Disasters\". Sounds... fun?",
	
	"HarveyPlus.spouseRoom_Harvey.1": "No air-traffic this morning, {{Nickname}}. But it's still fun to break out the equipment now and then.",
	"HarveyPlus.spouseRoom_Harvey.2": "I'm working on a new model plane. It's so much more relaxing here than in my old apartment.",
	"HarveyPlus.spouseRoom_Harvey.3": "I just finished my latest model, {{Nickname}}. Would you like to see it?",
	"HarveyPlus.spouseRoom_Harvey.4": "It's nice having my own space just for my hobbies. I think it's encouraged me to pursue them more.",
	"HarveyPlus.spouseRoom_Harvey.5": "Hi, {{Nickname}}. Did you need something? Sorry, I was a little distracted.",
	"HarveyPlus.spouseRoom_Harvey.6": "If you ever wanted me to show you how to operate my radio, I'd be happy to.",
	
	"HarveyPlus.OneKid_2": "I want to give %kid1 the best childhood possible.#$b#I think %farm Farm is the perfect place for that.$h",
	"HarveyPlus.OneKid_3": "So far, I really like being a father!$h#$e#It's not as scary as I thought it would be.",
	"HarveyPlus.TwoKids_2": "I already gave %kid1 and %kid2 their breakfasts. It's easy to feed them healthy food with so much farm-fresh produce to work with.",
	"HarveyPlus.TwoKids_3": "%kid1 was playing with one of my planes the other day.#$b#I'm glad I'm not the only one who enjoys them!$h",
	
	//A lot of these didn't NEED editing except they are phrased super weird so I tried to make them less uhhhh Strange
	//I also left out the ones about the NPC spouse being pregnant I'm sorry if you have a trans Harvey mod that I am not aware of
	//If you do oh my god please tell me I'd be all the way into trans Harvey. we can be t4t. T treated him really good to allow for a mustache that nice & im kinda jealous
	"HarveyPlus.NewChild_SecondChild1": "Our little family has really grown.. it's incredible to think how far we've come together.$1",
	"HarveyPlus.NewChild_SecondChild2": "Being a father to two beautiful children is like a dream come true. We really have come so far, haven't we?",
	"HarveyPlus.NewChild_Adoption": "{0} is just perfect... we're so incredibly lucky.",
	"HarveyPlus.NewChild_FirstChild": "I'm so glad everything went well. You take it easy while we get {0} settled, okay?",
	"HarveyPlus.Event.cs.1736": "$q -1 null#...Yes, {{Nickname}}?#$r -1 0 danceAsk#(Ask {0} to be your dance partner)#$r -1 0 null#Never mind...",
	"HarveyPlus.NPC.cs.4439": "I wonder if bringing a baby into the house will be too big of a change?$s",
	"HarveyPlus.NPC.cs.4440": "I hope our adoption request gets approved, {0}. I've got my heart set on being a father.$l",
	"HarveyPlus.NPC.cs.4441": "Well, {0}, I filed our adoption papers. I double-checked to make sure everything was filled out correctly. Now... we wait.$l",
	"HarveyPlus.NPC.cs.4447": "I've been reading up on parenting to get ready for when our baby arrives. I'm so excited!$h",
	"HarveyPlus.NPC.cs.4448": "You have that pregnant glow, {0}. It really suits you.$l",
	
	"HarveyPlus.Good_0": "I still can barely believe we're married, {{Nickname}}. It just doesn't feel real sometimes...$1",
	"HarveyPlus.Good_1": "I was so lonely before you came into my life... it was awful.$s#$b#Thank you for saving me from that.$1",
	"HarveyPlus.Good_2": "I think I understand now why they call a spouse your \"other half\".#$b#It's like marrying you filled an empty place in me.$1",
	"HarveyPlus.Good_3": "Oh, {{Nickname}}... you look so ${handsome^beautiful^amazing}$.$1#$e#I mean! Even more than usual.$7",
	"HarveyPlus.Good_4": "The apartment was just somewhere I lived...#$b#Here, with you? This feels like a real home.$1",
	"HarveyPlus.Good_5": "I was just admiring my wedding amulet... I never take it off, you know.$1",
	"HarveyPlus.Good_6": "Be careful, for my sake? I know you're very capable, but I still have nightmares about losing you...$7",
	"HarveyPlus.Good_7": "I appreciate how hard you work, {{Nickname}}.$h#$b#Though... maybe you could take tonight off? We could stay in and open a bottle of wine.$1",
	"HarveyPlus.Good_8": "I never thought I'd be able to have this kind of life.#$b#I feel so incredibly lucky.$h",
	"HarveyPlus.Good_9": "You keep my life interesting, {{Nickname}}. I don't think I'll ever get bored, living here!$h",
	
	"HarveyPlus.Neutral_0": "I don't really have anything planned for today.#$e#I guess I could dust the shelves again...",
	"HarveyPlus.Neutral_1": "How are we doing on groceries?",
	"HarveyPlus.Neutral_2": "Maybe I'll start a new book. I have a couple I've been meaning to get to.",
	"HarveyPlus.Neutral_3": "Sorry, {{Nickname}}, I can't talk for long. I have a lot of paperwork to get to today.",
	"HarveyPlus.Neutral_4": "How long has it been since we sat down and talked?",
	"HarveyPlus.Neutral_5": "{{Nickname}}? Is there anything you'd like me to get done today?",
	"HarveyPlus.Neutral_6": "If you go into town later, could you ask Gunther if he has that book I ordered in from Zuzu Library?",
	"HarveyPlus.Neutral_7": "I think we might be out of coffee.#$e#I do go through it kind of quickly.",
	"HarveyPlus.Neutral_8": "I've certainly settled into a routine here.#$e#It would be nice to shake things up sometime.$s",
	"HarveyPlus.Neutral_9": "Do you think you'll ever get bored of me?$s",
		
	"HarveyPlus.Bad_0": "It feels like we're just not on the same frequency lately.$s",
	"HarveyPlus.Bad_1": "*sigh*... I'm starting to like being at the clinic better than being at home.$s",
	"HarveyPlus.Bad_2": "Maybe you could cook your own dinner tonight for a change, @.$a",
	"HarveyPlus.Bad_3": "I feel like I must have done something wrong. You'd tell me if I had, right?$s",
	"HarveyPlus.Bad_4": "Sometimes I feel like I'm just another decoration to you.$a",
	"HarveyPlus.Bad_5": "Sometimes I worry you're out of the house so much just to avoid being around me.$s",
	"HarveyPlus.Bad_6": "I still feel like something's missing in my life...$s#$e#maybe you aren't what I needed after all.$s",
	"HarveyPlus.Bad_7": "Lately I feel like all I do is cook and clean.$s",
	"HarveyPlus.Bad_8": "We never talk anymore, @. I miss that...$s",
	"HarveyPlus.Bad_9": "Do you think we made the right choice, getting married? Sometimes I wonder.$s",
	
	//Seasonal Marriage Dialogue - Spring
	//A lot of this is the default since I didn't want to get rid of them entirely; it changes in other seasons
	
	"HarveyPlus.Spring.Rainy_Day_0": "Spring rain is my favorite kind. It makes everything feel so fresh afterward.$h",
	"HarveyPlus.Spring.Rainy_Day_1": "It was so incredibly lonely living above the clinic by myself... I'm much happier now.$h",
	"HarveyPlus.Spring.Rainy_Day_2": "I woke up early, but I made sure not to wake you. You looked so peaceful.",
	"HarveyPlus.Spring.Rainy_Day_3": "I don't mind the rain. Sure, I can't watch the planes go by, but I can still listen to the radio chatter.#$e#It makes the whole thing a little more mysterious.",
	"HarveyPlus.Spring.Rainy_Day_4": "This is perfect weather for staying inside and reading the latest issue of \"Vascular Monthly\".#$e#It's more fun than it sounds!$h",
	"HarveyPlus.Spring.Rainy_Night_0": "How was your day, {{Nickname}}? I caught up on some chores I wanted to get done.",
	"HarveyPlus.Spring.Rainy_Night_1": "I took the day to check if there were any leaks.#$b#This place is water-tight! Robin did an incredible job fixing it up.$h",
	"HarveyPlus.Spring.Rainy_Night_2": "You look a little soggy, {{Nickname}}.#$b#Still refusing to use an umbrella, huh?$h",
	"HarveyPlus.Spring.Rainy_Night_3": "I always feel like I sleep better on rainy nights.#$b#The sound is incredibly soothing.",
	"HarveyPlus.Spring.Rainy_Night_4": "I made us a nice healthy dinner. Only fresh, wholesome ingredients from the valley! [225 226 237 196 200]#$e#It's so nice having more time to cook.$h",
	
	"HarveyPlus.Spring.Indoor_Day_0": "I think we're all striving to reach some kind of balance in life. Homeostasis, you know?#$e#For me, moving here was exactly what my body needed to find that balance.$l",
	"HarveyPlus.Spring.Indoor_Day_1": "Good morning, {{Nickname}}! I made you a nutritious breakfast.[201]#$e#You're always so hard at work; you need your energy!$h",
	"HarveyPlus.Spring.Indoor_Day_2": "I'm going to study the medical literature today. It's important for me to keep up-to-date so I can give my patients the best care possible!",
	"HarveyPlus.Spring.Indoor_Day_3": "I'm going to listen to some jazz music and finalize my medical reports today. What do you have planned, {{Nickname}}?",
	"HarveyPlus.Spring.Indoor_Day_4": "I was afraid of you when we first met. It's funny to think about now that we've come so far.$h",
	"HarveyPlus.Spring.Indoor_Night_0": "You look like you could use a good massage tonight, {{Nickname}}.#$e#Luckily I spent the day brushing up on my understanding of the muscular system.",
	"HarveyPlus.Spring.Indoor_Night_1": "I took it easy today... spent some time reading, fiddled with my radio, and worked on a model airplane.#$e#I feel like I've become much better at taking breaks since I married you.$h",
	"HarveyPlus.Spring.Indoor_Night_2": "I hope you know that I don't mind if you stay out late occasionally.#$e#I know you have a lot to get done every day.",
	"HarveyPlus.Spring.Indoor_Night_3": "It's really great to live somewhere as relaxing as %farm Farm.#$e#I feel like my blood pressure's improved significantly since I moved out here.$h",
	"HarveyPlus.Spring.Indoor_Night_4": "Oh! Sorry, I was just daydreaming and forgot what I was going to do.#$e#About what? Oh... You know. Planes.$1",
		
	"HarveyPlus.Spring.Outdoor_0": "The view from here is lovely. You've really done a great job with the place.$h",
	"HarveyPlus.Spring.Outdoor_1": "It's good to stop working and breathe in the fresh %farm Farm air sometimes. Don't you think?",
	"HarveyPlus.Spring.Outdoor_2": "I may not be the most exciting guy, but I'll stay loyal to you for the rest of my life.$l",
	"HarveyPlus.Spring.Outdoor_3": "@... {{Nickname}}... you mean the world to me.$l",
	"HarveyPlus.Spring.Outdoor_4": "Watching your crops grow has made me want to learn more about the science behind farming. It's more complicated than I thought!",
	"HarveyPlus.Spring.patio_Harvey.1": "You know, \"The Journal of Tendon Dynamics\" is actually bearable when I'm reading out here.",
	"HarveyPlus.Spring.patio_Harvey.2": "I know it's not quite as impressive as your farm, but I've grown to really enjoy tending my little garden.$h",
	"HarveyPlus.Spring.patio_Harvey.3": "I've started reading for pleasure more. It's nice to put down the medical literature sometimes.",
	"HarveyPlus.Spring.patio_Harvey.4": "I was thinking about planting some herbs. It would be nice to have fresh basil for homemade pesto.",
		
	"HarveyPlus.Spring.funLeave_Harvey.1": "I think I'll go out and get some fresh air today. It'll be nice to get out of the house.",
	"HarveyPlus.Spring.funLeave_Harvey.2": "Oh, {{Nickname}}! I was thinking of going out today. The valley is so nice this time of year.$h",
	"HarveyPlus.Spring.funLeave_Harvey.3": "One of these days I'd like to work up to real hiking.#$b#For now, though, going into town is a good start.",
	"HarveyPlus.Spring.funReturn_Harvey.1": "I had a nice day. Spending time alone now and then allows me to organize my thoughts.",
	"HarveyPlus.Spring.funReturn_Harvey.2": "Did you have a good day, {{Nickname}}?#$e#I'm a little tired, but the good kind of tired.",
	"HarveyPlus.Spring.funReturn_Harvey.3": "I saw a rare Southern Valley Mallard on my walk today!$h#$e#I wish I'd had a camera with me to take a picture. I did manage to pick up a feather, though. [444]",
	
	"HarveyPlus.Spring.OneKid_0": "I always dreamed of having a family, you know.#$e#I used to think I'd be a bachelor forever... I love you so much.$1",
	"HarveyPlus.Spring.OneKid_1": "I'm not actually that worried about %kid1 getting hurt out on the farm.#$b#One of the best things about kids is how sturdy they are. They're built to get into trouble.$h",
	"HarveyPlus.Spring.TwoKids_0": "I believe a child should be allowed to play and explore to their heart's content. It's good to encourage their natural curiosity.",
	"HarveyPlus.Spring.TwoKids_1": "Keeping track of two children is better exercise than anything else I've ever tried!$h",
		
	//Seasonal Marriage Dialogue - Summer
	
	"HarveyPlus.Summer.Rainy_Day_0": "Take care that you don't slip in the mud outside!#$e#I can't help but worry about you.",
	"HarveyPlus.Summer.Rainy_Day_1": "This feels like a good day to stay in and work on one of my model planes.",
	"HarveyPlus.Summer.Rainy_Day_2": "Hm... I was going to go for a walk today, but that might not be in the cards.",
	"HarveyPlus.Summer.Rainy_Day_3": "If we're lucky, this rain will help cool things off a little.",
	"HarveyPlus.Summer.Rainy_Day_4": "I think I'll catch up on my reading today. I just got the latest issue of \"Head, Shoulders, Knees and Toes\".",
	"HarveyPlus.Summer.Rainy_Night_0": "Hi, {{Nickname}}. Did you have a productive day today?#$e#I bet the rain didn't slow you down any.$h",
	"HarveyPlus.Summer.Rainy_Night_1": "I've been hearing scratching coming from under the porch at night.#$b#Do you think we might have raccoons?",
	"HarveyPlus.Summer.Rainy_Night_2": "I never thought of myself as the \"rustic cabin\" kind of guy, but I've really taken a liking to it.$h",
	"HarveyPlus.Summer.Rainy_Night_3": "Try not to track any mud inside, {{Nickname}}. I just mopped earlier.",
	"HarveyPlus.Summer.Rainy_Night_4": "You look hungry, {{Nickname}}. Lucky for you, I decided to spend my day trying out a new recipe. [212 214 209 204]$h",
		
	"HarveyPlus.Summer.Indoor_Day_0": "The sky looks great today... so clear!#$e#From now on, I'm only going to go into the clinic when I have appointments. Otherwise I can just work from home!",
	"HarveyPlus.Summer.Indoor_Day_1": "Good morning, {{Nickname}}! I got up early to make you breakfast.[201]#$e#I hope me banging around in the kitchen didn't wake you up.",
	"HarveyPlus.Summer.Indoor_Day_2": "Hm... what should I do today?#$e#Honestly, this heat makes me want to take a nap.$h",
	"HarveyPlus.Summer.Indoor_Day_3": "I've been thinking... maybe I'll try iced coffee for a change.#$e#Variety is the spice of life, right?$h",
	"HarveyPlus.Summer.Indoor_Day_4": "Days tend to be longest in Summer.#$b#That means more time to fill with whatever you like!",
	"HarveyPlus.Summer.Indoor_Night_0": "I find most of the Summer bugs annoying, but I have to admit, the butterflies are nice.",
	"HarveyPlus.Summer.Indoor_Night_1": "It's great living out here where there's relatively little light pollution.#$e#You can see almost every star in the sky.$1",
	"HarveyPlus.Summer.Indoor_Night_2": "This house has surprisingly good acoustics.#$b#It's almost got me thinking about picking up piano again.",
	"HarveyPlus.Summer.Indoor_Night_3": "Are there really animate skeletons in the mines?#$e#You know, in retrospect, I shouldn't have asked.$s",
	"HarveyPlus.Summer.Indoor_Night_4": "...$1#$b#Oh, sorry. I just got caught up in looking at you.",
		
	"HarveyPlus.Summer.Outdoor_0": "Whoof... it's hot out here. I might head inside again soon.",
	"HarveyPlus.Summer.Outdoor_1": "I can't tell you how lucky I feel to get to spend my life with you.$1",
	"HarveyPlus.Summer.Outdoor_2": "Have you noticed? There's a bird's nest up under the roof.#$e#%farm Farm is so full of life!",
	"HarveyPlus.Summer.Outdoor_3": "This is so much nicer than being cooped up in the clinic all day.$l#$e#I love watching you work on the farm... hehe.$1",
	"HarveyPlus.Summer.Outdoor_4": "Be sure to drink enough water today, {{Nickname}}. It's easy to get dehydrated in weather like this.",
	"HarveyPlus.Summer.patio_Harvey.1": "A bee landed on me earlier.#$b#Oh, don't worry! They don't sting unless you bother them. She went on her way eventually.$h",
	"HarveyPlus.Summer.patio_Harvey.2": "I might be overwatering my plants... I'm just worried about this heat drying them out!",
	"HarveyPlus.Summer.patio_Harvey.3": "I saw a rabbit past the fence not too long ago.#$b#If you're quiet he might come back.",
	"HarveyPlus.Summer.patio_Harvey.4": "Sometimes I think about bringing my radio equipment out here... but I'd just have to cart it back inside any time it rained.",
		
	"HarveyPlus.Summer.funLeave_Harvey.1": "I'm putting down the paperwork today and going out. I could use some time to myself.",
	"HarveyPlus.Summer.funLeave_Harvey.2": "I think I need to stretch my legs. I'll be back tonight, okay?",
	"HarveyPlus.Summer.funLeave_Harvey.3": "I'm going out today, {{Nickname}}. I'll let you know if I see any interesting wildlife!",
	"HarveyPlus.Summer.funReturn_Harvey.1": "I've heard this can be used to make an excellent risotto. I'd love to try making one sometime! [259 248]",
	"HarveyPlus.Summer.funReturn_Harvey.2": "I think I may have got a little bit of a sunburn, despite my best efforts... do my ears look red to you?",
	"HarveyPlus.Summer.funReturn_Harvey.3": "Sometimes I think I should get one of those mobile casette players.#$b#It would be nice to listen to music while I'm out walking.",
	
	"HarveyPlus.Summer.OneKid_0": "I've found that a couple of minutes of some quiet jazz music puts %kid1 straight to sleep.#$b#I'm just glad something works reliably.$h",
	"HarveyPlus.Summer.OneKid_1": "%kid1 almost yanked out a chunk of my mustache earlier.#$b#A strong grip is a good sign! It means motor development is proceeding at a healthy rate.",
	"HarveyPlus.Summer.TwoKids_0": "I wonder if the kids are old enough to go out and catch fireflies...#$e#Oh, we'd set them free, of course. But they're fun to look at for a little while.",
	"HarveyPlus.Summer.TwoKids_1": "%kid1 helped me make fruit juice popsicles yesterday.#$e#Well. I made the popsicles. %kid1 mostly handled eating them.$h",
	
	//Seasonal Dialogue - Fall
	
	"HarveyPlus.Fall.Rainy_Day_0": "Do you ever think about how the older we get, the faster time seems to go by?#$b#Ah, sorry. Days like this make me more contemplative than normal.",
	"HarveyPlus.Fall.Rainy_Day_1": "The sound of the rain is almost like a natural drumline.#$b#I wonder what nature's equivalent to a saxophone is...?",
	"HarveyPlus.Fall.Rainy_Day_2": "They're playing classic movies all day today on TV. I might see if \"The Zuzu City Express\" is on.",
	"HarveyPlus.Fall.Rainy_Day_3": "You don't need to do any watering today, so why don't you stay in this morning?#$e#It would be nice to just sit and talk for a bit.",
	"HarveyPlus.Fall.Rainy_Day_4": "I've heard that pumpkin flavored coffee is popular this time of year.#$e#I admit it does sound interesting...",
	"HarveyPlus.Fall.Rainy_Night_0": "I spent today re-organizing the kitchen cabinets.#$e#I know it sounds boring, but I find that kind of thing relaxing. I can just put on some music and turn my brain off.",
	"HarveyPlus.Fall.Rainy_Night_1": "I think the small moments in life are just as important as the big ones.#$e#Just being here with you and listening to the rain is enough for me.",
	"HarveyPlus.Fall.Rainy_Night_2": "Wow, is it %time already? Today just flew by.#$e#I guess I must have been having fun.$h",
	"HarveyPlus.Fall.Rainy_Night_3": "Hi. It's good to see you.$h#$e#Oh, me? I spent the day skimming through some medical journals.",
	"HarveyPlus.Fall.Rainy_Night_4": "I decided to finally try out one of those recipes I had saved. I think it came out alright, but you tell me what you think! [230 235 236 237]$h",
		
	"HarveyPlus.Fall.Indoor_Day_0": "Good morning, {{Nickname}}. I've been up for a while already.#$e#Sometimes it's nice to enjoy the early morning quiet.",
	"HarveyPlus.Fall.Indoor_Day_1": "Here's your breakfast, {{Nickname}}, just how you like it. I think I got the consistency on the eggs just right this time. [201]$h",
	"HarveyPlus.Fall.Indoor_Day_2": "If you see any edible mushrooms while you're out today, be sure to pick them up.#$e#There's nothing fresher than straight off the ground!$h", 
	"HarveyPlus.Fall.Indoor_Day_3": "Sometimes I wonder what my life would be like if you'd never read that letter from your Grandfather...#$b#I'm glad that you did.$1",
	"HarveyPlus.Fall.Indoor_Day_4": "Did you sleep well last night, {{Nickname}}? I had the strangest dream...#$e#You were growing pumpkins, but they just kept growing until they were taller than I was! Weird, right?",
	"HarveyPlus.Fall.Indoor_Night_0": "You know, there are so many good fishing spots in Pelican Town but I've never actually gone fishing.#$e#We should make a day of it sometime. Would you like that?",
	"HarveyPlus.Fall.Indoor_Night_1": "I think there's an owl living in the woods around here.#$e#I've heard hooting at night before, but I've never managed to spot it.",
	"HarveyPlus.Fall.Indoor_Night_2": "I didn't pick up any radio chatter today, but I did see several flocks of birds heading South.",
	"HarveyPlus.Fall.Indoor_Night_3": "I'm due for an eye exam but I've been putting off scheduling one.#$b#They say doctors are the worst patients and I admit there's some truth to that.",
	"HarveyPlus.Fall.Indoor_Night_4": "It's funny to think about how I used to be scared of getting old.#$b#I think what I was really scared of was getting old alone. I'd love to grow old with you.$1",
		
	"HarveyPlus.Fall.Outdoor_0": "This is a very safe spot. You go on ahead and take care of business, don't worry about me.",
	"HarveyPlus.Fall.Outdoor_1": "Are you thinking of decorating for Spirit's Eve?#$e#I never did when I lived alone, but then, there wasn't much point.",
	"HarveyPlus.Fall.Outdoor_2": "You know, Fall foliage is only so colorful because all of the leaves are dying. It feels bittersweet, doesn't it?",
	"HarveyPlus.Fall.Outdoor_3": "Crisp fall air... a hot cup of coffee... I can't imagine what else I could ask for.$h",
	"HarveyPlus.Fall.Outdoor_4": "I've grown very fond of %farm Farm. I wouldn't want to live anywhere else.",
	"HarveyPlus.Fall.patio_Harvey.1": "These mushrooms are purely decorative. They're pretty, but no good for eating!",
	"HarveyPlus.Fall.patio_Harvey.2": "It's a little chilly out here today. Maybe I should have worn thicker socks.",
	"HarveyPlus.Fall.patio_Harvey.3": "Hm? Oh, sorry. I was completely caught up in this book. I've been on a historical fiction kick lately.",
	"HarveyPlus.Fall.patio_Harvey.4": "I should ask Leah to build me one of those decorative windmills.#$b#I think it would look nice out here, don't you?",
		
	"HarveyPlus.Fall.funLeave_Harvey.1": "I think I'll go out today. There's something uniquely refreshing about crisp Fall air.",
	"HarveyPlus.Fall.funLeave_Harvey.2": "I'm going to be out of the house today, so don't worry if you come back and I'm not here.",
	"HarveyPlus.Fall.funLeave_Harvey.3": "I have some things I'd like to take care of in town. See you tonight?",
	"HarveyPlus.Fall.funReturn_Harvey.1": "I happened to come across a wild mushroom on my walk today. A few more of these and we could make a great pasta sauce. [257 281 404 430]",
	"HarveyPlus.Fall.funReturn_Harvey.2": "I know it's a little childish, but I do sometimes go out of my way to step on dry leaves.#$e#That sound is one of the best parts of Fall.$h",
	"HarveyPlus.Fall.funReturn_Harvey.3": "I saw the strangest thing today: a mushroom as tall as a tree.#$e#I didn't know they could get that big. It was a little intimidating.",
	
	"HarveyPlus.Fall.OneKid_0": "Don't worry about %kid1; I'll handle parenting duties today. You can focus on getting things done around the farm.",
	"HarveyPlus.Fall.OneKid_1": "I suppose now that I have a child I'll have to warm up to Spirit's Eve.#$b#If %kid1 wants to go through the maze, though, that's all you.",
	"HarveyPlus.Fall.TwoKids_0": "The house is really starting to feel full now with both %kid1 and %kid2 here.#$e#I like it; it's cozy.",
	"HarveyPlus.Fall.TwoKids_1": "I think %kid1 and %kid2 are really bonding as siblings. I saw the two of them reading a book together earlier.#$e#Well. Looking at the pictures in a book, anyway. Close enough.",
	
	//Seasonal Dialogue - Winter
	//I believe some of these don't actually proc in winter, but I'm leaving them in anyway. Secret dialogue! If you're reading this file, hello, I hope you're having a good day. I just finished my last grad school class of the semester and I am feeling Grand :)
	
	"HarveyPlus.Winter.Rainy_Day_0": "It's a little unusual for it to rain in Winter. I wonder if Spring is coming early this year?",
	"HarveyPlus.Winter.Rainy_Day_1": "Make sure you stay dry today, {{Nickname}}. I don't want you to become hypothermic.",
	"HarveyPlus.Winter.Rainy_Day_2": "There was some interesting chatter over the radio this morning.#$b#Apparently an Ember Airlines pilot had to make an emergency water landing.#$b#It was all anyone could talk about.$h",
	"HarveyPlus.Winter.Rainy_Day_3": "How would you feel about soup for dinner tonight? This feels like soup weather.",
	"HarveyPlus.Winter.Rainy_Day_4": "Have you got your flu shot yet, {{Nickname}}? It's best to do it sooner rather than later.",
	"HarveyPlus.Winter.Rainy_Night_0": "Do they make heated weighted blankets?#$e#If they don't, they should. There must be a market for that.",
	"HarveyPlus.Winter.Rainy_Night_1": "I checked the smoke detectors today.#$b#If we're going to have a fire going we should make sure that they're all functional.",
	"HarveyPlus.Winter.Rainy_Night_2": "You look a little chilled, {{Nickname}}.#$b#Go and warm yourself up by the fire, alright? I'll make you something warm to drink.",
	"HarveyPlus.Winter.Rainy_Night_3": "I know I'm usually a coffee guy, but tonight felt like it called for tea. Here, I made you a cup too. [StardropTea 614]",
	"HarveyPlus.Winter.Rainy_Night_4": "I've been thinking about getting into journaling.#$e#I've heard it's good for a person's mental health, but I think I'd worry too much about making it look nice.",
		
	"HarveyPlus.Winter.Indoor_Day_0": "Don't worry about getting me the perfect gift this year.#$b#I'd treasure anything you gave me.$1",
	"HarveyPlus.Winter.Indoor_Day_1": "Don't forget to eat a healthy breakfast, {{Nickname}}. It's the best way to start your day! [201]",
	"HarveyPlus.Winter.Indoor_Day_2": "Every year Maru gifts me a coffee mug with a different element from the periodic table on it.#$e#I'm hoping this year I'll get the last of the Halogens.$h",
	"HarveyPlus.Winter.Indoor_Day_3": "I mixed hot cocoa powder into my coffee this morning. It's a very lazy way to make a mocha!$h",
	"HarveyPlus.Winter.Indoor_Day_4": "I'm going to do laundry today. If you have anything you want washed, this is your last chance to put it in the hamper.",
	"HarveyPlus.Winter.Indoor_Night_0": "You're as ${handsome^beautiful^perfect}$ as the day I married you.$1#$e#Too cheesy? Sorry, I get a little sentimental this time of year.",
	"HarveyPlus.Winter.Indoor_Night_1": "I decided to go a little bit out of my comfort zone and try reading a mystery book.#$e#Did you know there's an entire genre called \"cozy mystery\"? It sounds contradictory but I'm actually enjoying it a lot!$h",
	"HarveyPlus.Winter.Indoor_Night_2": "Maru once tried to explain something called \"Flight Simulator\" to me.#$b#I've never been fantastic with computers, but I might look into it.",
	"HarveyPlus.Winter.Indoor_Night_3": "Don't forget to leave the taps running overnight to keep the pipes from freezing.#$e#I made that mistake once. Trust me.$s",
	"HarveyPlus.Winter.Indoor_Night_4": "Did you hear? The Zuzu Underground Orchestra is releasing a new album this month.#$e#This will be the first one with the new cellist. We'll see how it turns out.",
		
	"HarveyPlus.Winter.Outdoor_0": "Being able to see my own breath is always fun...$h#$b#Right up until it fogs up my glasses.$a",
	"HarveyPlus.Winter.Outdoor_1": "They've started playing holiday music on all of the radio stations.#$b#I don't mind it as much as other people, but it's still nice to take a break from it out here where it's quiet.",
	"HarveyPlus.Winter.Outdoor_2": "You can still get sunburnt in the Winter, you know. Protecting your skin is a year-round job.",
	"HarveyPlus.Winter.Outdoor_3": "Are you planning out how you're going to organize your crops this Spring?#$b#Or are you going to play it by ear?",
	"HarveyPlus.Winter.Outdoor_4": "Oh, good morning, {{Nickname}}. I was just enjoying the brisk morning air.",
	"HarveyPlus.Winter.patio_Harvey.1": "I'm taking the Winter break to decide what I want to plant out here come Spring.#$b#I was thinking tulips might be nice.",
	"HarveyPlus.Winter.patio_Harvey.2": "Hm... maybe I should ask Robin to build a roof over this patio.#$b#Then I could sit out here even in the snow or the rain.",
	"HarveyPlus.Winter.patio_Harvey.3": "The book I'm reading is set in a desert country.#$b#It's my theory that reading about a place where it's hot might fool my brain into thinking it's warm here too.#$e#There's no real science behind that, but hope springs eternal.$h",
	"HarveyPlus.Winter.patio_Harvey.4": "Hi, {{Nickname}}. Where are you headed today?#$b#Don't stay out too late. We're supposed to hit sub-zero temperatures tonight.", 
		
	"HarveyPlus.Winter.funLeave_Harvey.1": "Alright... time to bundle up and run some errands. Do you need anything in town, {{Nickname}}?",
	"HarveyPlus.Winter.funLeave_Harvey.2": "Hm... we could use some more hand soap. I can go pick some up.#$e#Proper hand-washing is essential in the middle of cold and flu season.",
	"HarveyPlus.Winter.funLeave_Harvey.3": "I think it might be nice to get out of the house today.#$b#I feel like I'm starting to get cabin fever.",
	"HarveyPlus.Winter.funReturn_Harvey.1": "I tripped over this on my way home... it was hidden under the snow. [412 416 536 709 749]#$b#It looked like something you could use.$h",
	"HarveyPlus.Winter.funReturn_Harvey.2": "Phew! It's good to be home. What did you do today?#$b#Did you spend all day in the mines again?#h",
	"HarveyPlus.Winter.funReturn_Harvey.3": "Sorry I'm back a little late; I kept getting distracted.#$e#Oh, not by anything important. Mainly watching the birds.",
	
	"HarveyPlus.Winter.OneKid_0": "It just ocurred to me that having a child means we can officially start establishing family holiday traditions.#$e#I'll have to think of some...",
	"HarveyPlus.Winter.OneKid_1": "Did you want to do family postcards this year?#$b#I have some far-off relatives who I'm sure would love an update on how %kid1 is doing.",
	"HarveyPlus.Winter.TwoKids_0": "%kid1 took a drink of my coffee earlier before I could take the cup away.#$b#I think that what's called a 'teaching moment'. There's a reason only grown-ups drink coffee.$h",
	"HarveyPlus.Winter.TwoKids_1": "It's interesting how quickly children form distinct personalities.#$b#%kid1 and %kid2 are totally different, wouldn't you say?",
	
	//Misc
	
	"HarveyPlus.Killed.1": "Easy now, {{Nickname}}. Take it slow.",
	"HarveyPlus.Killed.2": "You were found unconscious and in critical condition; there was no time to transport you to Zuzu City.#$b#I had to perform an emergency surgery to stabilize you.$s",
	"HarveyPlus.Killed.3": "You can stay here in the clinic until you get your feet back under you.",
	"HarveyPlus.Killed.4": "Just be more careful out there, for my sake?#$b# I know I sometimes worry too much, but when this kind of thing happens it starts to feel justified.$s#$b# I don't know what I'd do if I ever lost you.",
	
	"HarveyPlus.Rainy.1": "Hi @! It's good weather for staying inside and reading.#$e#So... have you read anything good lately?",
	"HarveyPlus.Rainy.2": "Have you ever noticed that almost no one in this town uses an umbrella?#$e#I think I saw Sebastian with one, once...$s",
	"HarveyPlus.Rainy.3": "I suppose it's nice to have a day off from watering your crops.#$b#Everyone needs a break now and then.$h",
	"HarveyPlus.Rainy.4": "I hate going outside on days like this.#$e#My glasses get all fogged up and then I'm as blind with them on as I am without.",
	"HarveyPlus.Rainy.5": "Ugh. I stepped in a puddle earlier and my socks are still soaked.",
	"HarveyPlus.Rainy.6": "Wearing wet clothing can't actually make you sick, but I'd still recommend changing when you get home.#$b#Basic comfort is also important!",
	
}